## **Задача:** 
 Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## **Примеры:**
 [“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
 
 [“1234”, “1567”, “-2”, “computer science”] → [“-2”]

 [“Russia”, “Denmark”, “Kazan”] → []



## **Ход решения задачи:**

1. Задаем первый массив строк **firstArray**.
2. Задаем длинну второго массива строк  **secArrLength**, которую определит функция **GetLengthSecondArray**.
3. Задаем второй массив **secondArray** и заполняем с помощью функции **FillSecondArray**.
4. Отпечатываем для визуализации первый массив с помощью функции **Console.WriteLine**, оформляя его квадратными скобками.
5. Отпечатываем для визуализации второй массив с помощью функции **Console.WriteLine**, оформляя его квадратными скобками.

## **Подробнее про функции:**


### **PrintArray** 
Функция, которая перебирает все элементы массива и отпечатывает каждый элемент в консоли.

Функция на вход принимает массив строк и реализована с помощью цикла ***for***, который перебирает все элементы массива с помощью индекса ***i***, и не выходит за пределы массива благодаря функции определения размера массива ***inArray.Length***. На каждом цикле происходит отпечатывание элемента массива с заданным индексом в консоли с помощью функции ***Console.WriteLine***. По завершению каждого цикла происходит инкремент индекса ***i***.

Поскольку функция типа ***void***, на выходе она ничего не возвращает.


### **GetLengthSecondArray** 
Это  функция, которая проверяет, сколько в пером массиве ***firstArray*** содержится строк, длинна которых меньше, либо равна 3 символам, чтобы задать размер будущего второго массива ***secondArray***.

На вход эта функция принимает первый массив строк ***array***.

Эта функция влючает в себя счетчик строк с 3 символами и меньше, который именуется ***count***, и реализуется через цикл ***for***, где ***i*** - это индекс элементов первого массива. Цикл ***for*** проходит по всему массиву, не выходя за его пределы благодаря определению длинны массива с помощью функции ***array.Length***. По завершению выполнения цикла, индекс увеличивается благодаря инкременту ***i***.

В ходе цикла ***for*** находится еще цикл ***if***, который проверяет длинну строки с заданным индексом с помощью функции ***array[i].Length***. Если длинна меньше, либо равна ***3***, тогда счетчик ***count*** увеличивается с помощью инкремента.

По завершению цикла ***for*** функция **GetLengthSecondArray** возвращает значение счетчика ***count***.


### **FillSecondArray**
Это функция, которая создает новый массив строк ***result*** и записывает в него элементы первого массива, которые меньше, либо равны 3 символам.

На вход функция принимает первый массив, а также информацию о длинне второго массива.

Для начала функция создает новый массив ***result*** с размерностью ***len***, которую функция приняла на вход.
Эта функция влючает в себя счетчик строк с 3 символами и меньше, который именуется ***count***. 

Функция реализуется через цикл ***for***, который перебирает весь первоначальный массив строк с помощью индекса ***i*** и ограничивается длинной массива ***array.Length*** не выходя за его пределы. По завершению выполнения цикла, индекс увеличивается благодаря инкременту ***i***.

В ходе цикла ***for*** находится цикл ***if***, который проверяет длинну строки с заданным индексом ***array[i].Length***. Если длинна меньше, либо равна ***3***, тогда значение элемента с заданным индексом ***array[i]*** присваивается элементу нового массива ***result*** с индексом ***count***, а также счетчик ***count*** увеличивается с помощью инкремента.

 По завершению цикла ***for*** функция **FillSecondArray** возвращает заполненный новый массив строк.


 ## Дополнительная информация:
 К задаче приложена блок-схема основной содержательной части метода **FillSecondArray**, которая поясняет логику отбора элемента массива строк, размер которого меньше, либо равен 3 символам. Приложенная блок-схема в формате **png** называется **flowchart** находится в основной папке **FINAL_CONTROL_WORK**. 